rottenpotatoes/app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "TestTitle"], ["rating", "TestRating"], ["description", "TestDesc"], ["created_at", "2018-10-12 22:50:47.338438"], ["updated_at", "2018-10-12 22:50:47.338438"]]

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "ChangeTitle"], ["rating", "ChangeRating"], ["description", "ChangeDesc"], ["updated_at", "2018-10-09 22:27:46.203031"], ["id", 1]]